Experiment Setups - Yugabyte/results/yugabyte_tservers_7/pgbench_t5.log
pgbench -h 127.0.0.1 -p 5433 -U yugabyte -d demo -c 200 -j 8 -t 5 -M prepared -n -f ../workloads/read50_write50.sql --max-tries=5
pgbench (17.4, server 15.12-YB-2.25.2.0-b0)
transaction type: ../workloads/read50_write50.sql
scaling factor: 1
query mode: prepared
number of clients: 200
number of threads: 8
maximum number of tries: 5
number of transactions per client: 5
number of transactions actually processed: 1000/1000
number of failed transactions: 0 (0.000%)
number of transactions retried: 0 (0.000%)
total number of retries: 0
latency average = 1222.340 ms
initial connection time = 1272.264 ms
tps = 163.620650 (without initial connection time)